export const ways = [
  {
    title: '📌 Початок шляху',
    description: 'Я розпочав свій шлях у розробці приблизно в середині 2022 року. Довгий час я вагався щодо зміни професії, не наважуючись зробити вирішальний крок. Проте певні події в моїй країні змусили мене переосмислити все та діяти рішуче.',
  },

  {
    title: '📌 Самостійне навчання',
    description: 'Спочатку я навчався самостійно, переглядаючи матеріали в інтернеті. Згодом зрозумів, що хаотичне навчання не дає бажаного результату. Я розглянув два варіанти: курси або індивідуальне наставництво, і обрав другий.',
  },

  {
    title: '📌 Основи фронтенду',
    description: 'Моє навчання розпочалося без використання фреймворків і навіть без JavaScript. Це дозволило мені зрозуміти, наскільки багато можна зробити лише за допомогою HTML і CSS. Згодом я почав вивчати чистий JavaScript, починаючи зі старих версій, а потім перейшов до сучасних стандартів.',
  },

  {
    title: '📌 Поглиблення знань',
    description: 'Наступним кроком стало вивчення jQuery та TypeScript. Я досліджував різні підходи до розробки, експериментував і порівнював можливості різних технологій. Це допомогло мені краще зрозуміти принципи побудови сучасних веб-додатків.',
  },

  {
    title: '📌 Вибір фреймворку та розвиток',
    description: 'Спочатку я обрав Angular, адже він часто використовується у великих проєктах. Саме з ним я отримав свій перший комерційний досвід і глибше зрозумів структуру фронтенд-розробки. Згодом я почав освоювати React, оскільки він широко застосовується в сучасних веб-додатках. Тепер я працюю з обома фреймворками, що дозволяє мені бути більш гнучким у виборі технологій. 🚀',
  },
]

export const differences = {
  html: ' HTML - це мова розмітки, яка визначає структуру веб-сторінки за допомогою тегів',
  css: 'Css - це мова стилів, яка відповідає за оформлення та візуальне представлення HTML-елементів',
  js: 'JavaScript - це мова програмування, яка додає інтерактивність і динамічну поведінку веб-сторінкам',
}